## Staging: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                      NAME                                      |
|--------|--------------------------------------------------------------------------------|
| add    | `aws_cloudwatch_metric_alarm.healthcheck_lambda_form_archiver_invocations`     |
|        | `aws_cloudwatch_metric_alarm.healthcheck_lambda_nagware_invocations_schedule`  |
|        | `aws_cloudwatch_metric_alarm.healthcheck_lambda_response_archiver_invocations` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.healthcheck_lambda_form_archiver_invocations will be created
  + resource "aws_cloudwatch_metric_alarm" "healthcheck_lambda_form_archiver_invocations" {
      + actions_enabled                       = true
      + alarm_description                     = "HealthCheck - no `form-archiver` invocations in a day."
      + alarm_name                            = "FormArchiverLambdaNoInvocations"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "form-archiver"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Invocations"
      + namespace                             = "AWS/Lambda"
      + period                                = 86400
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
    }

  # aws_cloudwatch_metric_alarm.healthcheck_lambda_nagware_invocations_schedule will be created
  + resource "aws_cloudwatch_metric_alarm" "healthcheck_lambda_nagware_invocations_schedule" {
      + actions_enabled                       = true
      + alarm_description                     = "HealthCheck - no `nagware` invocations on schedule."
      + alarm_name                            = "NagwareLambdaNoInvocationsSchedule"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "breaching"

      + metric_query {
          + id          = "invocations"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "FunctionName" = "nagware"
                }
              + metric_name = "Invocations"
              + namespace   = "AWS/Lambda"
              + period      = 86400
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "IF((DAY(invocations)==2 OR DAY(invocations)==4 OR DAY(invocations)==7),invocations,1)"
          + id          = "invocations_schedule"
          + label       = "Invocations (schedule)"
          + return_data = true
        }
    }

  # aws_cloudwatch_metric_alarm.healthcheck_lambda_response_archiver_invocations will be created
  + resource "aws_cloudwatch_metric_alarm" "healthcheck_lambda_response_archiver_invocations" {
      + actions_enabled                       = true
      + alarm_description                     = "HealthCheck - no `response-archiver` invocations in a day."
      + alarm_name                            = "ResponseArchiverLambdaNoInvocations"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "response-archiver"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Invocations"
      + namespace                             = "AWS/Lambda"
      + period                                = 86400
      + statistic                             = "Sum"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + threshold                             = 1
      + treat_missing_data                    = "breaching"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_5xx_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_signin_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_form_archiver_invocations"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_nagware_invocations_schedule"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_response_archiver_invocations"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_submission_invocations_anomaly"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_submission_invocations_core_hours"]
WARN...
```

</details>
